app/controllers/applications_controller.rb

SELECT * FROM `applications`
---
  def index
    @applications = Application.all

SELECT * FROM `applications` WHERE (`applications`.`id` = 1)
---
  def show
    @application = Application.find(params[:id])

INSERT INTO `applications` (`comment`, `created_at`, `updated_at`, `url`, `user_id`, `job_id`) VALUES('cvxcv', '2010-08-12 10:26:20', '2010-08-12 10:26:20', 'cvcx', 2, -614137768)
---
  def create

    @application = Application.new(params[:application])
    @application.user_id = current_user.id

    respond_to do |format|
      if @application.save