app/controllers/jobs_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    if current_user
      @jobs = Job.all - Job.find_all_by_user_id(current_user)
    else
         @jobs = Job.find(:all)

SELECT * FROM `skills` ORDER BY name
---
  def create

    @job = Job.new(params[:job])
    @job.user_id = current_user.id
    respond_to do |format|
      if @job.save
        format.html { redirect_to(@job, :notice => 'Job was successfully created.') }
        format.xml  { render :xml => @job, :status => :created, :location => @job }
      else
        @skills = Skill.all