app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `is_admin`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('6AZQMaIpmTIcbcVu0FRR', '2010-08-10 05:45:38', '2010-08-10 05:45:38', '3c7d5cc1efdc8a0498940e5951238a3efb2e6815b2f9e1f5fcca054af4daf3d9d076d3c62ef68937afd750a81a96aad4458fd23ff564ae37a2fbc24c0624bd84', 'ANC6Pbm9L9JL6vbAKdXr', '2010-08-10 05:45:38', 0, '127.0.0.1', 'Asfn2nq1Y2Frc381LO7', '2010-08-10 05:45:38', 0, 'a48211afed77bc9ecb1c40bc3450f0fa91a2564f0c90f8d80a3ed3ad65eb2189d24dac0efafadf041b1808add2088bc684d96329060845fba2d8d41a78ccd0ff', 1, NULL, 'kalpesh', NULL, 'kdaev@gmail.com')